In [3]:
import pandas as pd

# 0. Crear el dataset de productos
data = {
    'Producto': ['Laptop', 'Mouse', 'Monitor', 'Teclado', 'Laptop', 'Monitor', 'Smartphone', 'Smartphone'],
    'Tipo': ['Electrónica', 'Accesorios', 'Electrónica', 'Accesorios', 'Electrónica', 'Electrónica', 'Móvil', 'Móvil'],
    'Marca': ['Dell', 'Logitech', 'Samsung', 'Logitech', 'HP', 'LG', 'Apple', 'Xiaomi'],
    'Precio': [1200, 25, 300, 45, 1100, 280, 1000, 600]
}

df = pd.DataFrame(data)
df

     Producto         Tipo     Marca  Precio
0      Laptop  Electrónica      Dell    1200
1       Mouse   Accesorios  Logitech      25
2     Monitor  Electrónica   Samsung     300
3     Teclado   Accesorios  Logitech      45
4      Laptop  Electrónica        HP    1100
5     Monitor  Electrónica        LG     280
6  Smartphone        Móvil     Apple    1000
7  Smartphone        Móvil    Xiaomi     600

In [10]:
#1. Agrupar un dataset de productos por “tipo”
df_grouped = df.groupby('Tipo')
df_grouped

In [11]:
#2. Mostrar cantidad de productos y precio promedio.
summary = df_grouped.agg({'Producto': 'count', 'Precio': 'mean'}).rename(columns={'Producto': 'Cantidad de Productos', 'Precio': 'Precio Promedio'})
summary

             Cantidad de Productos  Precio Promedio
Tipo
Accesorios                       2             35.0
Electrónica                      4            720.0
Móvil                            2            800.0

In [13]:
#3. Aplicar .agg() con dos funciones combinadas.
detailed_summary = df_grouped.agg({
    'Precio': ['mean', 'max', 'min'],
    'Producto': 'count'
}).rename(columns={'Producto': 'Cantidad de Productos'})

detailed_summary

            Precio            Cantidad de Productos
              mean   max  min                 count
Tipo
Accesorios    35.0    45   25                     2
Electrónica  720.0  1200  280                     4
Móvil        800.0  1000  600                     2

In [ ]:
#ASI LO HIZO LA PROFE 
# 1, 2 y 3. Agrupar por "Tipo", mostrar cantidad y precio promedio usando .agg()
# 'count' nos da la cantidad de productos y 'mean' el precio promedio
df_resumen = df.groupby('Tipo').agg({
    'Precio': ['count', 'mean']
})

df_resumen

In [ ]:
#4. Usar .pivot_table() para ver totales por marca y tipo.
tabla_cantidades = pd.pivot_table(
    df,
    index='Marca',
    columns='Tipo',
    aggfunc='size',
    fill_value=0
)

tabla_cantidades

Tipo      Accesorios  Electrónica  Móvil
Marca
Apple              0            0      1
Dell               0            1      0
HP                 0            1      0
LG                 0            1      0
Logitech           2            0      0
Samsung            0            1      0
Xiaomi             0            0      1